{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "output_shape": null, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>}\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "batch_input_shape": [null, 64, 64, 3], "input_dtype": "float32", "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_1", "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 24, "border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_2", "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 36, "border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_3", "activation": "linear", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 48, "border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_4", "activation": "linear", "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "name": "convolution2d_5", "activation": "linear", "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [1, 1]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "bias": true, "name": "dense_1", "activation": "linear", "input_dim": 64, "b_regularizer": null, "output_dim": 1164, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "bias": true, "name": "dense_2", "activation": "linear", "input_dim": 1164, "b_regularizer": null, "output_dim": 100, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "bias": true, "name": "dense_3", "activation": "linear", "input_dim": 100, "b_regularizer": null, "output_dim": 50, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "bias": true, "name": "dense_4", "activation": "linear", "input_dim": 50, "b_regularizer": null, "output_dim": 10, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "bias": true, "name": "dense_5", "activation": "linear", "input_dim": 10, "b_regularizer": null, "output_dim": 1, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "trainable": true}}]}